{"answer_token_to_idx": null, "program_token_to_idx": {"<START>": 1, "filter_size[large]": 38, "relate[left]": 43, "filter_color[red]": 9, "unique": 51, "filter_ordinal[the second one of the,from right]": 26, "filter_ordinal[the first one of the,from front]": 16, "intersect": 40, "filter_ordinal[the second one of the,from front]": 24, "filter_color[blue]": 4, "filter_ordinal[the eighth one of the,from right]": 13, "filter_ordinal[the first one of the,from left]": 17, "<NULL>": 0, "filter_ordinal[the sixth one of the,from left]": 30, "filter_color[green]": 7, "filter_color[purple]": 8, "filter_ordinal[the fourth one of the,from front]": 19, "union": 50, "filter_size[small]": 39, "filter_material[metal]": 11, "relate[front]": 42, "filter_shape[sphere]": 37, "filter_ordinal[the third one of the,from right]": 34, "filter_material[rubber]": 12, "relate[right]": 44, "<UNK>": 3, "filter_ordinal[the fifth one of the,from front]": 14, "scene": 49, "filter_ordinal[the seventh one of the,from left]": 28, "same_shape": 47, "filter_ordinal[the sixth one of the,from front]": 29, "filter_ordinal[the fourth one of the,from right]": 21, "filter_shape[cube]": 35, "same_color": 45, "filter_shape[cylinder]": 36, "filter_ordinal[the seventh one of the,from front]": 27, "filter_ordinal[the third one of the,from left]": 33, "filter_color[yellow]": 10, "filter_color[cyan]": 6, "filter_ordinal[the second one of the,from left]": 25, "filter_color[brown]": 5, "<END>": 2, "filter_ordinal[the fourth one of the,from left]": 20, "filter_ordinal[the fifth one of the,from left]": 15, "filter_ordinal[the sixth one of the,from right]": 31, "filter_ordinal[the nineth one of the,from left]": 23, "same_material": 46, "same_size": 48, "filter_ordinal[the first one of the,from right]": 18, "filter_ordinal[the third one of the,from front]": 32, "relate[behind]": 41, "filter_ordinal[the nineth one of the,from front]": 22}, "refexp_token_to_idx": {"nineth": 46, "things": 74, "<START>": 1, "large": 39, "seventh": 61, "size": 66, "left": 40, "metal": 44, "Look": 7, "Any": 5, "color": 21, "cube": 22, "eighth": 27, "or": 53, "front": 33, "cyan": 24, "object(s)": 48, "cylinder(s)": 26, "other": 54, "Find": 6, "big": 16, "ball": 13, "on": 51, "in": 36, "of": 50, "<NULL>": 0, "metallic": 45, "object": 47, "green": 34, "both": 19, "from": 32, "rubber": 58, "tiny": 76, "side": 64, ";": 4, "have": 35, "that": 70, "either": 28, "block(s)": 17, "third": 75, "the": 71, "it": 38, "<UNK>": 3, "thing": 72, "thing(s)": 73, "at": 12, "red": 56, "same": 59, "shiny": 63, "one": 52, "cube(s)": 23, "sphere": 68, "are": 10, "purple": 55, "ball(s)": 14, "brown": 20, "behind": 15, "made": 41, "objects": 49, "small": 67, "as": 11, "second": 60, "first": 30, "material": 42, "right": 57, "is": 37, "matte": 43, "<END>": 2, "to": 77, "The": 8, "fifth": 29, "sphere(s)": 69, "blue": 18, "cylinder": 25, "yellow": 78, "and": 9, "sixth": 65, "fourth": 31, "shape": 62}}